src/DataProcessors/ОткрытиЗакрытиеСменыКасса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ОткрытиЗакрытиеСменыКасса</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Documents/Касса_ОткрытиеСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Касса_ОткрытиеСмены</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменаТТ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаЗаводскойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСмены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/Касса_ЗакрытиеСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Касса_ЗакрытиеСмены</Name>
			<BasedOn>
				<xr:Item>Document.Касса_ОткрытиеСмены</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеОперации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменаТТ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СменаКассы</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Касса_ОткрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыСмены</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Совпало</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>фРучноеЗакрытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПисьмоОтправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/ОткрытиЗакрытиеСменыКасса/Ext/ManagerModule.bsl
Функция ПолучитьСменуКассы() Экспорт
	Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ВложенныйЗапрос.Ссылка,
	//|	ВложенныйЗапрос.МоментВремени КАК МоментВремени,
	//|	ВложенныйЗапрос.НомерСмены
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		Касса_ОткрытиеСмены.Ссылка КАК Ссылка,
	//|		Касса_ОткрытиеСмены.МоментВремени КАК МоментВремени,
	//|		Касса_ОткрытиеСмены.НомерСмены КАК НомерСмены
	//|	ИЗ
	//|		Документ.Касса_ОткрытиеСмены КАК Касса_ОткрытиеСмены
	//|	ГДЕ
	//|		НЕ Касса_ОткрытиеСмены.ПометкаУдаления
	//|		И Касса_ОткрытиеСмены.РабочееМесто = &РабочееМесто
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		Касса_ЗакрытиеСмены.Ссылка,
	//|		Касса_ЗакрытиеСмены.МоментВремени,
	//|		NULL
	//|	ИЗ
	//|		Документ.Касса_ЗакрытиеСмены КАК Касса_ЗакрытиеСмены
	//|	ГДЕ
	//|		НЕ Касса_ЗакрытиеСмены.ПометкаУдаления
	//|		И Касса_ЗакрытиеСмены.РабочееМесто = &РабочееМесто) КАК ВложенныйЗапрос
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	МоментВремени УБЫВ";
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(СУММА(влож.открытий), 0) > ЕСТЬNULL(СУММА(влож.Закрытий), 0)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Рез,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(СУММА(влож.открытий), 0) > ЕСТЬNULL(СУММА(влож.Закрытий), 0)
	               |			ТОГДА Касса_ОткрытиеСмены.Ссылка
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.Касса_ОткрытиеСмены.Пустаяссылка)
	               |	КОНЕЦ КАК Ссылка
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		КОЛИЧЕСТВО(Касса_ОткрытиеСмены.Ссылка) КАК открытий,
	               |		NULL КАК Закрытий
	               |	ИЗ
	               |		Документ.Касса_ОткрытиеСмены КАК Касса_ОткрытиеСмены
	               |	ГДЕ
	               |		НЕ Касса_ОткрытиеСмены.ПометкаУдаления
	               |		И Касса_ОткрытиеСмены.РабочееМесто = &РабочееМесто
	               |		И Касса_ОткрытиеСмены.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		NULL,
	               |		КОЛИЧЕСТВО(Касса_ЗакрытиеСмены.Ссылка)
	               |	ИЗ
	               |		Документ.Касса_ЗакрытиеСмены КАК Касса_ЗакрытиеСмены
	               |	ГДЕ
	               |		НЕ Касса_ЗакрытиеСмены.ПометкаУдаления
	               |		И Касса_ЗакрытиеСмены.РабочееМесто = &РабочееМесто
	               |		И Касса_ЗакрытиеСмены.СменаКассы.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)) КАК влож,
	               |	Документ.Касса_ОткрытиеСмены КАК Касса_ОткрытиеСмены
	               |ГДЕ
	               |	НЕ Касса_ОткрытиеСмены.ПометкаУдаления
	               |	И Касса_ОткрытиеСмены.РабочееМесто = &РабочееМесто
	               |	И Касса_ОткрытиеСмены.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Касса_ОткрытиеСмены.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Касса_ОткрытиеСмены.МоментВремени УБЫВ";
				   
	Запрос.УстановитьПараметр("РабочееМесто", глРабочееМесто);
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	глПараметрыРМ = глПараметрыРМ;
	
	Если Выборка.Следующий() и не Выборка.Ссылка.Пустая() Тогда
	//Если Выборка.Следующий() И ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.Касса_ОткрытиеСмены") Тогда
		
		Если ТипЗнч(глПараметрыРМ) = Тип("Структура") Тогда
			глПараметрыРМ.Вставить("НомерСмены", Выборка.Ссылка.НомерСмены);
		КонецЕсли;
		Возврат Выборка.Ссылка;
	Иначе
		Если ТипЗнч(глПараметрыРМ) = Тип("Структура") Тогда
			глПараметрыРМ.Вставить("НомерСмены", 0);
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Документы.ОткрытиеСмены.ПустаяСсылка();
	
КонецФункции

Функция ПолучитьСменуКассыПоНомеруКассы(Дата, НомерКассы) Экспорт
	Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ВложенныйЗапрос.Ссылка,
	//|	ВложенныйЗапрос.МоментВремени КАК МоментВремени
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		Касса_ОткрытиеСмены.Ссылка КАК Ссылка,
	//|		Касса_ОткрытиеСмены.МоментВремени КАК МоментВремени,
	//|		Касса_ОткрытиеСмены.Дата КАК Дата
	//|	ИЗ
	//|		Документ.Касса_ОткрытиеСмены КАК Касса_ОткрытиеСмены
	//|	ГДЕ
	//|		НЕ Касса_ОткрытиеСмены.ПометкаУдаления
	//|		И Касса_ОткрытиеСмены.Касса.КодСУП = &НомерКассы
	//|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//|	ВЫБРАТЬ
	//|		Касса_ЗакрытиеСмены.Ссылка,
	//|		Касса_ЗакрытиеСмены.МоментВремени,
	//|		Касса_ЗакрытиеСмены.Дата
	//|	ИЗ
	//|		Документ.Касса_ЗакрытиеСмены КАК Касса_ЗакрытиеСмены
	//|	ГДЕ
	//|		НЕ Касса_ЗакрытиеСмены.ПометкаУдаления
	//|		И Касса_ЗакрытиеСмены.СменаКассы.Касса.КодСУП = &НомерКассы) КАК ВложенныйЗапрос
	//|ГДЕ
	//|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	МоментВремени УБЫВ";
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВЫБОР
	               |		КОГДА Касса_ЗакрытиеСмены.Ссылка ЕСТЬ NULL
	               |			ТОГДА Касса_ОткрытиеСмены.Ссылка
	               |		ИНАЧЕ Касса_ЗакрытиеСмены.Ссылка
	               |	КОНЕЦ КАК Ссылка,
	               |	Касса_ОткрытиеСмены.МоментВремени КАК МоментВремени
	               |ИЗ
	               |	Документ.Касса_ОткрытиеСмены КАК Касса_ОткрытиеСмены
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Касса_ЗакрытиеСмены КАК Касса_ЗакрытиеСмены
	               |		ПО (Касса_ЗакрытиеСмены.СменаКассы = Касса_ОткрытиеСмены.Ссылка)
	               |			И (НЕ Касса_ОткрытиеСмены.ПометкаУдаления)
	               |ГДЕ
	               |	НЕ Касса_ОткрытиеСмены.ПометкаУдаления
	               |	И Касса_ОткрытиеСмены.Касса.КодСУП = &НомерКассы
	               |	И НАЧАЛОПЕРИОДА(Касса_ОткрытиеСмены.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	               |	И НЕ Касса_ОткрытиеСмены.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	МоментВремени УБЫВ";
	
	Запрос.УстановитьПараметр("НомерКассы", СокрЛП(НомерКассы));
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() И ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.Касса_ОткрытиеСмены") Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли; 
	
	Возврат Документы.ОткрытиеСмены.ПустаяСсылка();
	
КонецФункции

Функция ПолучитьПоследнююНеЗакрытуюСменуПоНомеру(НомерКассы,НомерСмены) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Касса_ОткрытиеСмены.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Касса_ОткрытиеСмены КАК Касса_ОткрытиеСмены
	               |ГДЕ
	               |	Касса_ОткрытиеСмены.КассаНомер = &КассаНомер
	               |	И Касса_ОткрытиеСмены.НомерСмены = &НомерСмены
				   //|	И НЕ Касса_ОткрытиеСмены.Ссылка В
				   //|				(ВЫБРАТЬ
				   //|					Касса_ЗакрытиеСмены.СменаКассы.Ссылка КАК СменаКассыСсылка
				   //|				ИЗ
				   //|					Документ.Касса_ЗакрытиеСмены КАК Касса_ЗакрытиеСмены)
	               |	И НЕ Касса_ОткрытиеСмены.ПометкаУдаления";
	Запрос.УстановитьПараметр("КассаНомер",НомерКассы);
	Запрос.УстановитьПараметр("НомерСмены",НомерСмены);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Документы.Касса_ОткрытиеСмены.ПустаяСсылка();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Ссылка;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ПолучитьДокументЗакрытияСмены(СменаКкм) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Касса_ЗакрытиеСмены.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Касса_ЗакрытиеСмены КАК Касса_ЗакрытиеСмены
	               |ГДЕ
	               |	НЕ Касса_ЗакрытиеСмены.ПометкаУдаления
	               |	И Касса_ЗакрытиеСмены.СменаКассы = &СменаКассы";
	Запрос.УстановитьПараметр("СменаКассы",СменаКкм);
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Док = Документы.Касса_ЗакрытиеСмены.СоздатьДокумент();
		Док.Дата = ТекущаяДата();
		Док.ОбменДанными.Загрузка = Истина;
		Док.Записать(РежимЗаписиДокумента.Запись);
		Возврат Док.Ссылка;
	КонецЕсли;
	Выборка = Рез.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
КонецФункции
